import { useState } from 'react';
import { HiOutlineXMark } from 'react-icons/hi2';
import {
  Modal,
  Button,
  Text,
  ActionIcon,
  Input,
  Password,
  Checkbox,
} from 'rizzui';

export default function CustomModalSelling() {
  const [modalState, setModalState] = useState(false);
  return (
    <>
      <Button onClick={() => setModalState(true)}>راهنمای سامانه</Button>
      <Modal
        isOpen={modalState}
        onClose={() => setModalState(false)}
        customSize="1080px"
      >
        <div className="m-auto px-7 pb-8 pt-6">
          <div className="mb-7 flex items-center justify-between">
            <Text tag="h3">راهنمای سامانه ماشین آلات</Text>
            <ActionIcon
              size="sm"
              variant="text"
              onClick={() => setModalState(false)}
            >
              <HiOutlineXMark className="h-auto w-6" />
            </ActionIcon>
          </div>
          <div className="[&_label>span]:font-medium">
            <ul className="list-decimal p-2 leading-10 text-gray-500 md:p-5">
              <li>
                <Text>
                  خرید ، فروش و اطلاع رسانی از طریق این سامانه کارشناسانه ،
                  مطمئن و منصفانه میباشد و سامانه نسبت به منافع خریدار و فروشنده
                  متعهد است.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  ارسال فیلم دستگاه ها و ماشین آلات به آدرس دفتر سامانه یا به
                  آدرس ایمیل سامانه جهت اطلاع رسانی مناسب یا ارزیابی سریع
                  کارشناسان سامانه مفید واقع میگردد.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  ر صورت غیر واقعی بودن اطلاعات ثبت شده ماشین آلات و یا ذکر قیمت
                  نامتعارف ، تایید و نمایش اطلاعات در سامانه منتفی میگردد.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  ذکر اطلاعات بیشتر در مورد ماشین آلات به سرعت انتخاب و تصمیم
                  گیری خریدار کمک میکند.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  در فرم ثبت مشخصات ماشین آلات امکان بارگذاری 1 الی 5 عکس از هر
                  دستگاه ( عکسهای جدید فعلی دستگاه ) فراهم است. ضمنا عکس ها
                  نباید از روی کاتالوک یا بروشور دستگاه تهیه گردد.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  درصورت فروش رفتن دستگاه ها و ماشین آلات ثبت شده در سامانه یا
                  انصراف از فروش درخواست میگردد جهت حذف اطلاعات مربوطه یا ویرایش
                  آن اقدام نمایید.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  شماره تماس پیگیری در اکثر موارد دفتر سامانه یا کارشناس مربوطه
                  خواهد بود و دلایل آن عبارتند از:
                  <ul className="list-disc p-2 leading-6 text-gray-500">
                    <li>
                      <Text>
                        آمادگی دفتر سامانه و یا کارشناس مربوطه در طول روز برای
                        پاسخگویی به خریدار (بعضی از فروشندگان ماشین آلات ، در
                        پاره ای از موارد در دسترس نمی باشند و امکان تماس با آنها
                        برای خریدار مقدور نیست).{' '}
                      </Text>
                    </li>
                    <li>
                      <Text>
                        جلوگیری از تماس های مکرر ، غیر مفید و بی موقع افراد با
                        فروشندگان دستگاهها.{' '}
                      </Text>
                    </li>
                    <li>
                      <Text>
                        ارزیابی و انطباق شرایط و ویژگیهای دستگاه با نیاز واقعی
                        خریدار توسط کارشناسان سامانه{' '}
                      </Text>
                    </li>
                  </ul>
                </Text>
              </li>
              <li>
                <Text>
                  درصورتیکه ماشین آلات ثبت شده شما در سامانه از کانال غیر به
                  فروش رفته باشد یا از فروش منصرف شوید سریعا نسبت به حذف اطلاعات
                  مربوط به آن دستگاه در سامانه اقدام فرمائید.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  دستگاهها و ماشین آلات دست دوم اکثرا فاقد گارانتی میباشند و در
                  زمان تحویل کارکرد آن ملاک است و طرفین میتوانند نسبت به نحوه
                  تحویل توافق نمایند.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  کارشناسان سامانه در صورت لزوم یا بنا به درخواست فروشنده یا
                  خریدار جهت ارزیابی و کارشناسی ماشین آلات آمادگی دارند.{' '}
                </Text>
              </li>
              <li>
                <Text>
                  برای هر نوع سوال و درخواست میتوانید ازطریق صفحه تماس با ما یا
                  ایمیل یا تلفن با مسئول بخش تماس حاصل نمایید. 02632774306 -
                  foodkeys[@]gmail.com{' '}
                </Text>
              </li>
            </ul>{' '}
          </div>
        </div>
      </Modal>
    </>
  );
}
